{
  "backend/main.mo": "Defines the main actor with storage/auth mixins, system health APIs, user profiles, and Binance account management.",
  "backend/migration.mo": "Migrates old user profiles to the new format by adding default tradingStatus while preserving other stored data.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across auth, layout, datasets, prompts, metrics, and trading.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light and dark theme variables for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, authentication gating, initialization, and feature pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Landing/login gate that shows marketing features and triggers Internet Identity login.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial user profile creation with name, email, and default trading settings.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sidebar navigation, trading sections, and logout handling.",
  "frontend/src/components/system/AppInitGate.tsx": "App initialization wrapper that handles loading, backend connection errors, and sign‑out.",
  "frontend/src/components/system/AsyncState.tsx": "Utility component to render loading, error, empty, or content states for async data.",
  "frontend/src/components/system/HealthStatusBanner.tsx": "Displays system health warnings or errors with a refetch option.",
  "frontend/src/components/system/RouteErrorBoundary.tsx": "Full‑screen error boundary for route failures with reload and home navigation buttons.",
  "frontend/src/components/trading/BinanceConnectionCard.tsx": "Manages connecting, verifying, and disconnecting a user's Binance API credentials.",
  "frontend/src/components/trading/LiveTradingConfirmDialog.tsx": "Confirmation dialog requiring a specific phrase before enabling live trading, handling confirm/cancel and pending state.",
  "frontend/src/components/trading/TradingModeBanner.tsx": "Displays a banner showing the user's current trading mode with icon, label, and description.",
  "frontend/src/components/trading/TradingModeSwitcher.tsx": "Select input for switching trading modes with a special confirmation flow for enabling live trading.",
  "frontend/src/features/backtests/BacktestConfigPage.tsx": "Static UI showing planned backtest configuration sections and notes that backend storage is not implemented.",
  "frontend/src/features/backtests/BacktestResultsPage.tsx": "Placeholder UI for displaying backtest results and metrics, indicating backend support is not yet available.",
  "frontend/src/features/backtests/RunBacktestPage.tsx": "Static page describing future backtest execution functionality and showing a placeholder execution card.",
  "frontend/src/features/datasets/datasetParsers.ts": "Parses CSV or JSON files into Candle objects with validation and timestamp normalization.",
  "frontend/src/features/datasets/DatasetsPage.tsx": "Dataset management UI allowing listing and uploading datasets with file parsing and async upload handling.",
  "frontend/src/features/episodes/EpisodeReviewPage.tsx": "Static UI for reviewing flagged episodes with placeholder alert and empty state. Backend episode logging is not yet implemented.",
  "frontend/src/features/metrics/MetricsPage.tsx": "Metrics dashboard UI with placeholders for performance indicators and backend-dependent data. Provides static cards and descriptions for future metrics.",
  "frontend/src/features/prompts/PromptLibraryPage.tsx": "Prompt template management page with create dialog, seed loading, and save/copy actions. Uses backend queries to load and store templates.",
  "frontend/src/features/prompts/promptSeeds.ts": "Defines default prompt templates for analysis, reward tuning, and orchestration. Each seed includes id, metadata, content, and example JSON I/O.",
  "frontend/src/features/trading/TradingHistoryPage.tsx": "Trade history viewer with filters and mock trade data. Computes filtered results and total PnL for display.",
  "frontend/src/features/trading/TradingOrdersPage.tsx": "Order placement and management UI with mock open orders and form validation. Supports paper, shadow, and live trading modes with toast feedback.",
  "frontend/src/features/trading/TradingPortfolioPage.tsx": "Displays a portfolio overview with mock balance, P&L, and open positions using cards and AsyncState.",
  "frontend/src/features/trading/TradingSafetyControlsPage.tsx": "Provides kill switch and risk limit controls for trading safety with UI inputs and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useActorStatus.ts": "Exposes actor loading state and a retry mechanism for reinitializing the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login, state management, and provider for loading and storing user identities.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables for light/dark modes and finance dashboard styling.",
  "frontend/src/lib/queries.ts": "Provides React Query hooks for backend data such as profiles, datasets, prompts, and health checks with timeout handling.",
  "frontend/src/lib/queryUtils.ts": "Offers utility helpers for query timeouts and error normalization.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store them in sessionStorage, retrieve them with persistence, and clear them from session or the hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration including dark mode, content paths, theme extensions, custom colors, typography, container settings, and animation keyframes.",
  "project_state.json": "Describes the project’s overall goals, architecture, issues, and feature versions for evolving a research dashboard into a production trading system."
}