{
  "kind": "build_request",
  "title": "Fix app loading and restore end-to-end startup reliability",
  "projectName": "Futures Lab",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Fix the app’s stuck-loading / blank-screen startup flow so the UI always reaches a stable state (AuthGate for signed-out users, or the main router for signed-in users) with clear, actionable error UI if initialization fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app isn't loading. Make sure everything is working end to end",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "When signed out, the app renders the AuthGate (not an infinite spinner) within 3 seconds.",
        "When signed in, the app renders the AppLayout + a route page (e.g., /datasets) within 5 seconds on a healthy backend.",
        "If the backend actor cannot be created or any required initialization step fails, AppInitGate shows the existing 'Unable to Initialize' error state with Retry and Sign Out actions, and Retry actually re-attempts initialization.",
        "No uncaught exceptions occur during initial render (no blank white/black screen)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Resolve backend/Frontend type mismatches that can crash or break rendering (especially for Motoko variant types such as HealthStatus and TradingMode) by ensuring frontend components correctly interpret the generated canister bindings at runtime.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app isn't loading. Make sure everything is working end to end"
        ]
      },
      "acceptanceCriteria": [
        "HealthStatusBanner correctly detects the healthy state and does not show an error banner when the backend returns #healthy.",
        "HealthStatusBanner correctly renders degraded/maintenance/unreachable/appIssue states based on the actual runtime shape of the generated binding (no string/variant mismatch).",
        "TradingModeBanner and TradingModeSwitcher correctly read and compare the trading mode value coming from UserProfile.tradingStatus.mode (no invalid comparisons that always fall through to default/null).",
        "The app compiles with no TypeScript errors related to HealthStatus/TradingMode comparisons and no runtime errors when rendering these components."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Make actor initialization resilient for non-admin users so normal logins do not fail due to missing admin secrets; only perform admin-only initialization when an admin token is present, and ensure regular authenticated users can successfully pass authorization checks for standard user flows (profile, datasets, prompts).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make sure everything is working end to end"
        ]
      },
      "acceptanceCriteria": [
        "Logging in with Internet Identity succeeds without requiring any URL parameter secret, and the app does not end up in AppInitGate error state for standard users.",
        "After login, fetching getCallerUserProfile either returns null (no profile yet) or a profile; it must not trap due to missing permissions during the standard user flow.",
        "A signed-in user can complete ProfileSetupModal and saveCallerUserProfile succeeds.",
        "A signed-in user can upload a dataset and later list it via getAllDatasetIds/getDataset without authorization traps."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add an end-to-end “startup smoke test” checklist implemented as minimal, user-visible diagnostics in the UI (not automated test infrastructure): provide a single debug panel or route section that shows actor readiness, auth state, and results of a basic health/profile probe so users can self-diagnose why loading fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app isn't loading. Make sure everything is working end to end"
        ]
      },
      "acceptanceCriteria": [
        "The diagnostics UI displays: (1) Internet Identity state (signed in/out), (2) actor status (ready/error), (3) latest getSystemHealth result or error, (4) latest getCallerUserProfile result or error.",
        "Diagnostics UI is accessible without editing immutable hook files and does not require developer tools to interpret common failures (e.g., shows normalized error messages).",
        "The diagnostics UI does not block normal operation and can be hidden/closed or placed in an unobtrusive location (e.g., footer link or settings-like section)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources); compose them instead.",
    "Do not edit any frontend paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing new external infrastructure (Prometheus/Grafana, external databases, separate execution services).",
    "Adding new trading/backtesting functionality beyond what is required to restore reliable loading and initialization.",
    "Integrating third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}