{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Futures Lab — Reliable startup, runtime type safety, and user-visible diagnostics",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Eliminate stuck loading/blank startup by adding time-bounded initialization fallback, robust actor retry, and safe error rendering paths.",
      "acceptanceCriteria": [
        "When signed out, the app renders the AuthGate (not an infinite spinner) within 3 seconds.",
        "When signed in, the app renders the AppLayout + a route page (e.g., /datasets) within 5 seconds on a healthy backend.",
        "If the backend actor cannot be created or any required initialization step fails, AppInitGate shows the existing 'Unable to Initialize' error state with Retry and Sign Out actions, and Retry actually re-attempts initialization.",
        "No uncaught exceptions occur during initial render (no blank white/black screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the unbounded full-screen 'Initializing...' gate with a time-bounded startup gate: if Internet Identity initialization exceeds ~3s, render a stable UI state (AuthGate for signed-out users; signed-in users still flow into AppInitGate) and provide a visible path to diagnostics for troubleshooting."
        },
        {
          "path": "frontend/src/hooks/useActorStatus.ts",
          "operation": "modify",
          "description": "Make Retry reliably recreate the actor by invalidating the exact React Query actor query keys (including identity-scoped keys) and surface the last actor creation error from the query cache when present so AppInitGate shows actionable error text."
        },
        {
          "path": "frontend/src/components/system/AppInitGate.tsx",
          "operation": "modify",
          "description": "Harden initialization rendering: ensure error UI always renders (even when error shape is non-Error), include normalized error text, and keep Retry wired to the improved useActorStatus retry mechanism."
        },
        {
          "path": "frontend/src/lib/queryUtils.ts",
          "operation": "modify",
          "description": "Improve error normalization to prevent uncaught exceptions and blank screens during initial render by handling common non-Error thrown shapes (e.g., objects from agent/canister failures) and returning stable English messages."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Fix runtime interpretation of Motoko variant-like values by normalizing HealthStatus and TradingMode into stable frontend representations before comparison/rendering.",
      "acceptanceCriteria": [
        "HealthStatusBanner correctly detects the healthy state and does not show an error banner when the backend returns #healthy.",
        "HealthStatusBanner correctly renders degraded/maintenance/unreachable/appIssue states based on the actual runtime shape of the generated binding (no string/variant mismatch).",
        "TradingModeBanner and TradingModeSwitcher correctly read and compare the trading mode value coming from UserProfile.tradingStatus.mode (no invalid comparisons that always fall through to default/null).",
        "The app compiles with no TypeScript errors related to HealthStatus/TradingMode comparisons and no runtime errors when rendering these components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/canisterValueNormalizers.ts",
          "operation": "create",
          "description": "Add small runtime normalizers for canister-returned values that may appear as strings/enums or Motoko-variant-shaped objects (single-key objects), including normalizeHealthStatus and normalizeTradingMode, returning stable values for safe comparisons."
        },
        {
          "path": "frontend/src/components/system/HealthStatusBanner.tsx",
          "operation": "modify",
          "description": "Use the new normalizer to interpret health.status before comparisons/switching so '#healthy' (and other statuses) render correctly regardless of runtime binding shape."
        },
        {
          "path": "frontend/src/components/trading/TradingModeBanner.tsx",
          "operation": "modify",
          "description": "Normalize profile.tradingStatus.mode before switch/label rendering so the banner reflects the actual mode returned at runtime (no fallthrough due to mismatched representations)."
        },
        {
          "path": "frontend/src/components/trading/TradingModeSwitcher.tsx",
          "operation": "modify",
          "description": "Normalize currentMode and the incoming Select value mapping so comparisons against TradingMode are correct even if the runtime value shape differs from the compile-time enum."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Prevent standard user startup from failing due to admin-token parsing/handling by improving admin secret extraction and making missing-secret failures diagnosable in the UI without modifying immutable hooks.",
      "acceptanceCriteria": [
        "Logging in with Internet Identity succeeds without requiring any URL parameter secret, and the app does not end up in AppInitGate error state for standard users.",
        "After login, fetching getCallerUserProfile either returns null (no profile yet) or a profile; it must not trap due to missing permissions during the standard user flow.",
        "A signed-in user can complete ProfileSetupModal and saveCallerUserProfile succeeds.",
        "A signed-in user can upload a dataset and later list it via getAllDatasetIds/getDataset without authorization traps."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Expand secret-token retrieval robustness for the admin token used during actor initialization: in addition to hash-only secrets, also support hash-route query parameters and standard query string parameters, and clear sensitive parameters from the visible URL when detected to reduce leakage risk."
        },
        {
          "path": "frontend/src/components/system/AppInitGate.tsx",
          "operation": "modify",
          "description": "Augment the existing 'Unable to Initialize' UI with more actionable, English guidance when initialization fails (e.g., distinguish missing/invalid admin token hints vs. connectivity/timeout), while keeping Retry/Sign Out behavior unchanged and functional."
        },
        {
          "path": "frontend/src/lib/queryUtils.ts",
          "operation": "modify",
          "description": "Ensure authorization/permission-related canister traps (often surfaced as opaque agent errors) are normalized into user-readable messages so standard users can understand why profile/dataset flows might fail."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add a minimal, user-visible startup diagnostics panel that reports auth state, actor readiness, and latest health/profile probe results without blocking normal use.",
      "acceptanceCriteria": [
        "The diagnostics UI displays: (1) Internet Identity state (signed in/out), (2) actor status (ready/error), (3) latest getSystemHealth result or error, (4) latest getCallerUserProfile result or error.",
        "Diagnostics UI is accessible without editing immutable hook files and does not require developer tools to interpret common failures (e.g., shows normalized error messages).",
        "The diagnostics UI does not block normal operation and can be hidden/closed or placed in an unobtrusive location (e.g., footer link or settings-like section)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/system/StartupDiagnosticsDialog.tsx",
          "operation": "create",
          "description": "Create a small diagnostics dialog/panel component that reads Internet Identity state, actor status (via useActorStatus), and performs non-blocking probes (useGetSystemHealth, useGetCallerUserProfile), rendering normalized results/errors in a compact checklist. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire an unobtrusive 'Diagnostics' entry (e.g., in the footer area) that opens/closes StartupDiagnosticsDialog without disrupting primary navigation/flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Expose access to the same diagnostics UI (or a link/button that opens it) for signed-out users so loading/auth/actor issues can be self-diagnosed without developer tools. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/queryUtils.ts",
          "operation": "modify",
          "description": "Ensure diagnostics displays human-readable errors by reusing normalizeError consistently for health/profile probe failures (no raw/opaque objects)."
        }
      ]
    }
  ]
}